backend/models/AdminForm.php

INSERT INTO `admin` (`username`, `email`, `status`, `auth_key`, `password_hash`, `created_at`, `updated_at`) VALUES ('cs', 'cs@fang.com', 10, 'E4RHWlq1Suo6ArZDegOqL225eg68qTTx', '$2y$13$scsBLjbmWVMqBht0M5kYEeiohgqCRHUFPGgmcF4yfuyD6IqW.ueCi', 1495126068, 1495126068)
UPDATE `admin` SET `auth_key`='7R2WjtCDf-inSb7xjURlmgpF6gwv7Kc9', `password_hash`='$2y$13$VPfMRsMUYiFQ777boIgMMumZqUi3ov33WFGX56mY0Z5ZyzNxCE82m', `status`=10, `updated_at`=1495126107 WHERE `id`=2
---
    public function save($runValidation = true, $attributeNames = null)
    {
        $data = \Yii::$app->request->post('AdminForm');
        $this->setAttribute('username', $data['username']);
        $this->setAttribute('email', $data['email']);
        $this->setAttribute('status', $data['status']);
        $this->generateAuthKey();
        if ($data['password']) {
            $this->setPassword($data['password']);
        }
        if ($this->getIsNewRecord()) {
            return $this->insert($runValidation, $attributeNames);
        } else {
            return $this->update($runValidation, $attributeNames) !== false;